--[[ 
     _        BY:@Aaa1R                     
  __| |_ __ __ _  __ _  ___  _ __  
 / _` | '__/ _` |/ _` |/ _ \| '_ \ 
| (_| | | | (_| | (_| | (_) | | | |
 \__,_|_|  \__,_|\__, |\___/|_| |_|
                 |___/             
--]]
do
function run(msg, matches)
  if matches[1] == "الاوامر" and is_momod(msg) then
    return "اهلا وسهلا بك 😻🎈 "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
💯اهلا بكم هناك 5 اوامر في البوت
🔸------------------------🔸

🐉م1 : لعرض اوامر الادمنيه و المدير

🐉م2 : لعرض اوامر تخص المجموعه 

🐉م4 : لعرض اوامر حمايه المجموعه 

🐉م4 : لعرض اوامر المطورين 
]].."\n"
.."🔸------------------------🔸".."\n"
..'💯ɖєṽ🐉:@Aaa1R'..'\n'
..'💯ɖєṽ🔞🌝:@sgoo56x_0'..'\n'
..'💯ɖєṽ✨🌝:@ll_ll_ll_12'..'\n'
..'💯ɖєṽ🌝🚫:@deve_poent'..'\n'
..'💯ɖєṽ⛓☠:@Oll56llO'..'\n'
..'💯CH : @love0o_o0'..'\n'
------------------

  elseif matches[1] == "م1" and is_momod(msg) then
    return "اهلا وسهلا بك 😻🎈 "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
  🔰 اوامر تـخص الادمنيـه و المـديـر 🔰
🔸--------------------------🔹

🔰 اوامر تـخص الادمنيـه و المـديـر 🔰
🔸--------------------------🔸

🔸رفع ادمن :- لرفع ادمن رد + معرف

🔸تنزيل ادمن :- لرفع ادمن رد + معرف

🔸رفع اداري:- لرفع اداري رد + معرف

🔸تنزيل اداري:- لرفع اداري رد + معرف

🔸حظر :- حظر عضو من المجموعه

🔸الغاء حظر :- الغاء الحظر عن عضو

🔸منع + الكلمه :- منع كلمه  

🔸الغاء منع + الكلمه :- الغاء منع كلمه 

🔸قائمه المنع:- اظهار الكلمات الممنوعه

🔸تنظيف قائمه المنع:- لمسح كل المنع

🔸ايدي :- عرض ايدي المجموعه
 
🔸ايدي بالرد :- عرض ايدي شخص 

🔸كتم :- لكتم عضو رد + معرف + ايدي

🔸المكتومين :- لعرض قائمه المكتومين
]].."\n"
.."🔸------------------------🔸".."\n"
..'💯ɖєṽ🐉:@Aaa1R'..'\n'
..'💯ɖєṽ🔞🌝:@sgoo56x_0'..'\n'
..'💯ɖєṽ✨🌝:@ll_ll_ll_12'..'\n'
..'💯ɖєṽ🌝🚫:@deve_poent'..'\n'
..'💯ɖєṽ⛓☠:@Oll56llO'..'\n'
..'💯CH : @love0o_o0'..'\n'
------------------


  elseif  matches[1] == "م2" and is_momod(msg) then 
    return "اهلا وسهلا بك 😻🎈 "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
🔸- اوامــر تــخــص  المـجـمـوعـه 👁‍🗨
🔸--------------------------🔸

🔸ضع صوره :- لوضع صوره 

🔸ضع قوانين:-لوضع قوانين 

🔸ضع وصف :-لوضع وصف  

🔸ضع اسم :- لوضع اسم  

🔸ضع  معرف :- لوضع معرف 

🔸ضع رابط :- لخزن رابط المجموعه

🔸الرابط :- رابط المجموعه 

🔸معلوماتي :- عرض معلوماتك

🔸معلومات المجموعه:-عرض معلومات

🔸اعدادت الوسائط:-اضهار الاعدادات

💯أوامر الحظر داخل المجموعة💯 
🔸------------------------🔸
🔸طرد <معرف-رد> ↜ لطرد |♻️
🔸 كتم <معرف-رد> ↜ كتم |😶
🔸 حظر <معرف-رد> ↜لحظر |🎐
🔸الغاء الحظر <معرف-رد> |🎌
🔸قائمة الحظر ↜ المحظورين |🎏
🔸ايدي ↜ ايدي|🆔
🔸دعبلني↜ دعبلني |👞
🔸------------------------🔸
]].."\n"
.."🔸------------------------🔸".."\n"
..'💯ɖєṽ🐉:@Aaa1R'..'\n'
..'💯ɖєṽ🔞🌝:@sgoo56x_0'..'\n'
..'💯ɖєṽ✨🌝:@ll_ll_ll_12'..'\n'
..'💯ɖєṽ🌝🚫:@deve_poent'..'\n'
..'💯ɖєṽ⛓☠:@Oll56llO'..'\n'
..'💯CH : @love0o_o0'..'\n'
------------------

  elseif  matches[1] == "م3" and is_momod(msg) then 
    return "اهلا وسهلا بك 😻🎈 "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
  🔒 اوامـــر حمـــايه الـــمجمـــوعه 🔓
🔸------------------------🔸
قفل + الامر / للقفل 🔐
فتح + الامر / للفتح  🔓
🔸------------------------🔸

🔸الصوت|📣
🔸الصور المتحركه|🌅
🔸الصور|🗻
🔸الفديو|📽
🔸اعاده توجيه|↪️
🔸التكرار|📈
🔸البوتات|🤖
🔸الروابط|📥
🔸 المعرف|🌀
🔸 التاك|📥
🔸 الشارحه|〰

🔸الاضافه|🚸
🔸الاضافه الجماعية|⛎
🔸الاشعارات|🌀
🔸جهات اتصال|💢
🔸الكلايش|📝
🔸الدردشه|🗣
🔸العربيه|✳️
🔸 الانلاين|📡
🔸 الدخول بالرابط|📍
🔸 السمايل|😃
  ]].."\n"
.."🔸------------------------🔸".."\n"
..'💯ɖєṽ🐉:@Aaa1R'..'\n'
..'💯ɖєṽ🔞🌝:@sgoo56x_0'..'\n'
..'💯ɖєṽ✨🌝:@ll_ll_ll_12'..'\n'
..'💯ɖєṽ🌝🚫:@deve_poent'..'\n'
..'💯ɖєṽ⛓☠:@Oll56llO'..'\n'
..'💯CH : @love0o_o0'..'\n'
------------------
  elseif  matches[1] == "م4" and is_owner(msg) then 
    return "اهلا وسهلا بك 😻🎈 "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
الاوامــر المــتـاحــه لــتــاچ مـخـي الــمــطـور 🐱🍹 👇🏾👇🏾
الاوامــر المــتـاحــه لــتــاچ مـخـي الــمــطـور 🐱🍹 👇🏾👇🏾

😈✋ترقيه سوبر  : لہٰتـحـويـل الـمـجـموعــه  سـوبــر♨️
♻️ تفعيل :  لـتـفعـيل الـبــوت فـي الـگـروب 
 🏌تعطيل : لــتعـطيـل الــبـوت فـي الــكـرب 🌝🌸 
 🙂🖖🏻رفع الـمديـر : لـرفع الــمـديـر  فـي الـكروب 😉❤️
🏃👞طرد البوت : لطـرد آلـبوت مـن الكــروب🤓👏
😼👋اذاعه + الكـلام : لـنـشـر فـي جـمـيـع الـكـروبـاب🙀✌
😼✌جلب ملف + اسمه : لــجلـب مـلـف مــن الـــسـيـرفـر 💯♻️
✅🌀معلومات السيرفر: لـمعـرفة نـشـآط الــبـوب  ➿💠
🚼 ضيف البوت + الرابط  : الاضــافـة الــبـوت آلہٰبہٰوت عـن طــريـق الــربـط🆗
😈✋حظر عام + المعرف : لــحظـر الــعـضـو مــن كــروبــات الــبـوت😹🚬
❌⚠️شــرحــهــا لحــظــر الــعــضــو + المعرف : الــغــاء الـعـام عــن آلــــــشخص 🔫😁
🐸😹قائمة العام   : لہٰمشـاهـــده آلـمـشحـوتـين عــام😹🌚
😕 تنشيط :  لــترســيـت البـــوت مــن الـسـيـرفـر🎃📿

🐊❓تصحيح :  لــتعـديـل عــمل الــبـوت🐱🍭
🤓🌴 تحديث :  لــتحـديـث البــــوت🌚✋
👇👆👇👆👇👆👇👆👇👆
المطورين 💋🙀👇
  ]].."\n"
.."🔸------------------------🔸".."\n"
..'💯ɖєṽ🐉:@Aaa1R'..'\n'
..'💯ɖєṽ🔞🌝:@sgoo56x_0'..'\n'
..'💯ɖєṽ✨🌝:@ll_ll_ll_12'..'\n'
..'💯ɖєṽ🌝🚫:@deve_poent'..'\n'
..'💯ɖєṽ⛓☠:@Oll56llO'..'\n'
..'💯CH : @love0o_o0'..'\n'
  end
end
return {
  patterns = {
    "^(الاوامر)",
    "^(م1)",
    "^(م2)",
    "^(م3)",
    "^(م4)",

  },
  run = run
}
end


--[[ 
     _        BY:@Aaa1R                     
  __| |_ __ __ _  __ _  ___  _ __  
 / _` | '__/ _` |/ _` |/ _ \| '_ \ 
| (_| | | | (_| | (_| | (_) | | | |
 \__,_|_|  \__,_|\__, |\___/|_| |_|
                 |___/             
--]]
